#define _CRT_SECURE_NO_WARNINGS 1

//#include<stdio.h>
//
//int main()
//{
//	int a = 10;
//	//   /  除法，求的是商
//	//   /两边的操作数都是整数的话，运行的是整数除法
//	//   /两边的操作数如果有一个是浮点数数，运行的就是小数除法
//	//   %  取余，求的是余数
//	//   %的两边必须是整数
//	printf("%lf\n", a / 3.0);
//	printf("%d\n", a % 3);
//	return 0;
//}


//#include<stdio.h>
//int main()
//{
//	//<<:左边抛弃、右边补0
//	int a = -3;
//	//10000000000000000000000000000011  原
//	//11111111111111111111111111111100  反
//	//11111111111111111111111111111101 -3的补码
//	//11111111111111111111111111111010  a<<1的补码
//	//11111111111111111111111111111001
//	//10000000000000000000000000000110  a<<1的原码 -6
//
//	int b = a << 1;
//	printf("%d\n", a);//-3
//	printf("%d\n", b);//-6
//	return 0;
//}



//#include<stdio.h>
//int main()
//{
//	int a = 3;
//	int b = a << -1;//error
//	return 0;
//}


//#include<stdio.h>
//
//int main()
//{
//	//>>右移操作符
//	int a = -5;
//	//10000000000000000000000000000101   -5原码
//	//11111111111111111111111111111010    反
//	//11111111111111111111111111111011    补码
//	//11111111111111111111111111111101    a>>1补码
//	//11111111111111111111111111111100     反
//	//10000000000000000000000000000011     原  -3
//	int b = a >> 1;
//	printf("%d\n", b);//-3
//	return 0;
//}



//#include<stdio.h>
//
//int main()
//{
//	int a = 3;
//	//00000000000000000000000000000011
//	int b = -5;
//	//10000000000000000000000000000101
//	//11111111111111111111111111111010
//	//11111111111111111111111111111011
//	int c = a & b;//3
//	//00000000000000000000000000000011
//	//11111111111111111111111111111011
//	//00000000000000000000000000000011
//	printf("%d\n", c);
//	return 0;
//}



//#include<stdio.h>
//
//int main()
//{
//	int a = 3;
//	//00000000000000000000000000000011
//	int b = -5;
//	//10000000000000000000000000000101
//	//11111111111111111111111111111010
//	//11111111111111111111111111111011
//	int c = a | b;//-5
//	//00000000000000000000000000000011
//	//11111111111111111111111111111011
//	//11111111111111111111111111111011
//	printf("%d\n", c);
//	return 0;
//}



//#include<stdio.h>
//
//int main()
//{
//	int a = 3;
//	//00000000000000000000000000000011
//	int b = -5;
//	//10000000000000000000000000000101
//	//11111111111111111111111111111010
//	//11111111111111111111111111111011
//	int c = a ^ b;//-8
//	//00000000000000000000000000000011
//	//11111111111111111111111111111011
//	//11111111111111111111111111111000
//	//11111111111111111111111111110111
//	//10000000000000000000000000001000
//	printf("%d\n", c);
//	return 0;
//}


//#include<stdio.h>
//int main()
//{
//	int a = 10;//创建和初始化
//	a = 20;//赋值
//	return 0;
//}


//#include<stdio.h>
//
//int main()
//{
//	int a = 10;
//	int b = 20;
//
//    a = a + b;
//	a += b;    
//    
//	return 0;
//}

//#include<stdio.h>
//int main()
//{
//	int flag = 0;
//	if (!flag)//如果flag为假，就打印呵呵
//	{
//		printf("hehe\n");
//	}
//	if (flag)//如果flag为真，就打印哈哈
//	{
//		printf("haha\n");
//	}
//	return 0;
//}



//#include<stdio.h>
//int main()
//{
//	int arr[10] = { 0 };
//	int* p = &arr;
//	printf("%d\n", sizeof(arr));
//	return 0;
//}


//#include<stdio.h>
//int main()
//{
//	int n = 0;
//	//scanf读取失败返回EOF -1
//	//-1的补码全是1
//	//(~(-1))得到的是0
//	//条件为假，则不进入while循环
//	while (~scanf("%d", &n))
//	{
//		printf("%d\n", n);
//	}
//	return 0;
//}


//#include<stdio.h>
//int main()
//{
//	int a = 10;
//	int* p = &a;
//	*p = 20;
//	printf("%d\n", a);
//	return 0;
//}



//#include <stdio.h>
////问(1)(2)(3)(4)是多少
////40 4 10 4或者40 8 10 8
//void test1(int arr[])
//{
//	printf("%d\n", sizeof(arr));//(2)
//}
//void test2(char ch[])
//{
//	printf("%d\n", sizeof(ch));//(4)
//}
//int main()
//{
//	int arr[10] = { 0 };
//	char ch[10] = { 0 };
//	printf("%d\n", sizeof(arr));//(1)
//	printf("%d\n", sizeof(ch));//(3)
//	test1(arr);
//	test2(ch);
//	return 0;
//}


//#include<stdio.h>
//int main()
//{
//	int a = 3 || 0;// 1 0
//	printf("%d\n", a);
//	return 0;
//}

